zhanzr/stm32c5-demo/board_t1_cmake/stm32c5xx_drivers/utils/i2c_timing/stm32_utils_i2c.c
#define I2C_PRESC_MAX                          (16U)
#define I2C_SCLDEL_MAX                         (16U)
#define I2C_SDADEL_MAX                         (16U)
#define I2C_SCLH_MAX                           (256U)
#define I2C_SCLL_MAX                           (256U)

#define SMBUS_IDLE_TIMEOUT_MIN                 (25000000UL) /* ns */
#define SMBUS_IDLE_TIMEOUT_MAX                 (35000000UL) /* ns */
#define SMBUS_SLAVE_EXT_LOW_TIMEOUT_MAX        (25000000UL) /* ns */
#define SMBUS_MASTER_EXT_LOW_TIMEOUT_MAX       (10000000UL) /* ns */

#define SEC2NSEC                               (1000000000UL)

/**
  * @}
  */

/* Private macros -------------------------------------------------------------*/
/** @defgroup I2C_Private_Macros I2C Private Macros
  * @{
  */

/** @brief  Rounds the given number to the nearest multiple of the divisor.
  * @param  x The number to be rounded.
  * @param  d The divisor used for rounding.
  * @return The rounded number.
  */
#define DIV_ROUND_CLOSEST(x, d)   (((x) + ((d) / 2.0)) / (d))

/**
  * @}
  */

/* Private types ------------------------------------------------------------*/
/** @defgroup I2C_Private_Types I2C Private Types
  * @{
  */
typedef struct
{
  uint32_t freq;      /*!< Frequency in Hz                           */
  uint32_t freq_min;  /*!< Minimum frequency in Hz                   */
  uint32_t freq_max;  /*!< Maximum frequency in Hz                   */
  uint32_t hddat_min; /*!< Minimum data hold time in ns              */
  uint32_t vddat_max; /*!< Maximum data valid time in ns             */
  uint32_t sudat_min; /*!< Minimum data setup time in ns             */
  uint32_t lscl_min;  /*!< Minimum low period of the SCL clock in ns */
  uint32_t hscl_min;  /*!< Minimum high period of SCL clock in ns    */
  uint32_t trise_max; /*!< Rise time max in ns                       */
  uint32_t trise_min; /*!< Rise time min in ns                       */
  uint32_t tfall_max; /*!< Fall time in ns                           */
  uint32_t tfall_min; /*!< Fall time in ns                           */
  uint32_t dnf;       /*!< Digital noise filter coefficient          */
} i2c_charac_t;

typedef struct
{
  uint32_t presc;     /*!< Timing prescaler */
  uint32_t tscldel;   /*!< SCL delay        */
  uint32_t tsdadel;   /*!< SDA delay        */
  uint32_t sclh;      /*!< SCL high period  */
  uint32_t scll;      /*!< SCL low period   */
} i2c_timings_t;

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @defgroup I2C_Private_Variables I2C Private variables
  * @{
  */

static i2c_timings_t i2c_valid_timing[I2C_VALID_TIMING_NBR_MAX];
static uint32_t      i2c_valid_timing_nbr;

static const i2c_charac_t i2c_charac[] =
{
  [I2C_SPEED_FREQ_STANDARD] =
  {
    .freq      = 100000U,
    .freq_min  = 80000U,
    .freq_max  = 120000U,
    .hddat_min = 0U,
    .vddat_max = 3450U,
    .sudat_min = 250U,
    .lscl_min  = 4700U,
    .hscl_min  = 4000U,
    .trise_min = 0U,
    .trise_max = 1000U,
    .tfall_min = 0U,
    .tfall_max = 300U,
    .dnf       = I2C_DIGITAL_FILTER_COEF,
  },
  [I2C_SPEED_FREQ_FAST] =
  {
    .freq      = 400000U,
    .freq_min  = 320000U,
    .freq_max  = 480000U,
    .hddat_min = 0U,
    .vddat_max = 900U,
    .sudat_min = 100U,
    .lscl_min  = 1300U,
    .hscl_min  = 600U,
    .trise_min = 20U,   /* 20 + 0.1Cb; cb ignored */
    .trise_max = 300U,
    .tfall_min = 20U,   /* 20 + 0.1Cb; cb ignored */
    .tfall_max = 300U,
    .dnf       = I2C_DIGITAL_FILTER_COEF,
  },
  [I2C_SPEED_FREQ_FAST_PLUS] =
  {
    .freq      = 1000000U,
    .freq_min  = 800000U,
    .freq_max  = 1200000U,
    .hddat_min = 0U,
    .vddat_max = 450U,
    .sudat_min = 50U,
    .lscl_min  = 500U,
    .hscl_min  = 260U,
    .trise_min = 0U,
    .trise_max = 120U,
    .tfall_min = 0U,
    .tfall_max = 120U,
    .dnf       = I2C_DIGITAL_FILTER_COEF,
  },
};

/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup I2C_Private_function I2C Private function
  * @{
  */
static uint32_t I2C_Compute_SCLL_SCLH(const stm32_utils_i2c_timing_advanced_config_t *p_config, uint32_t i2c_speed);
static stm32_utils_i2c_status_t I2C_Compute_PRESC_SCLDEL_SDADEL(const stm32_utils_i2c_timing_advanced_config_t
                                                                *p_config,
                                                                uint32_t i2c_speed);
/**
  * @}
  */

/* Exported functions ------------------------------------------------------- */
/** @addtogroup UTILS_I2C_Exported_Functions UTILS I2C Functions
  * @{
  */

/**
  * @brief  Compute I2C timing according to the current I2C clock source and required I2C clock.
  * @param  p_config Pointer to a @ref stm32_utils_i2c_timing_basic_config_t structure that contains
  *         the required parameters for I2C timing computation.
  * @param  p_output_timing_reg Pointer to an I2C_TIMINGR register value computed by referring to the I2C
            initialization section in the Reference Manual. This value is directly computed by STM32CubeMX2.
  * @retval STM32_UTILS_I2C_OK    Timing calculation successful.
  * @retval STM32_UTILS_I2C_ERROR Timing calculation error.
  */
stm32_utils_i2c_status_t STM32_UTILS_I2C_ComputeTimingBasic(const stm32_utils_i2c_timing_basic_config_t *p_config,
                                                            uint32_t *p_output_timing_reg)
{
  stm32_utils_i2c_status_t status = STM32_UTILS_I2C_ERROR;
  stm32_utils_i2c_timing_advanced_config_t p_advanced_config;
  uint32_t idx;

  i2c_valid_timing_nbr = 0U;

  if ((p_config->clock_src_freq_hz != 0U) && (p_config->i2c_freq_hz != 0U))
  {
    for (uint32_t speed = 0U; speed <= I2C_SPEED_FREQ_FAST_PLUS; speed++)
    {
      if ((p_config->i2c_freq_hz >= i2c_charac[speed].freq_min) \
          && (p_config->i2c_freq_hz <= i2c_charac[speed].freq_max))
      {
        p_advanced_config.clock_src_freq_hz = p_config->clock_src_freq_hz;
        p_advanced_config.i2c_freq_hz       = p_config->i2c_freq_hz;
        p_advanced_config.trise_ns          = i2c_charac[speed].trise_max / 2U;
        p_advanced_config.tfall_ns          = i2c_charac[speed].tfall_max / 2U;
        p_advanced_config.dnf               = i2c_charac[speed].dnf;
        p_advanced_config.af                = STM32_UTILS_I2C_ANALOG_FILTER_ENABLED;

