zhanzr/stm32c5-demo/board_t1_cmake/stm32c5xx_drivers/utils/i2c_timing/stm32_utils_i2c.c
        if (I2C_Compute_PRESC_SCLDEL_SDADEL(&p_advanced_config, speed) != STM32_UTILS_I2C_OK)
        {
          return STM32_UTILS_I2C_ERROR;
        }

        idx = I2C_Compute_SCLL_SCLH(&p_advanced_config, speed);

        if (idx < I2C_VALID_TIMING_NBR_MAX)
        {
          *p_output_timing_reg = ((i2c_valid_timing[idx].presc   & 0x0FUL) << 28U) | \
                                 ((i2c_valid_timing[idx].tscldel & 0x0FUL) << 20U) | \
                                 ((i2c_valid_timing[idx].tsdadel & 0x0FUL) << 16U) | \
                                 ((i2c_valid_timing[idx].sclh    & 0xFFUL) << 8U)  | \
                                 (i2c_valid_timing[idx].scll     & 0xFFUL);

          status = STM32_UTILS_I2C_OK;
        }
        break;
      }
    }
  }

  return status;
}


/**
  * @brief  Compute I2C timing according to the current I2C clock source and required I2C clock.
  * @param  p_config Pointer to a @ref stm32_utils_i2c_timing_advanced_config_t structure that contains
  *         the required parameters for I2C timing computation.
  * @param  p_output_timing_reg Pointer to an I2C_TIMINGR register value computed by referring to the I2C
            initialization section in the Reference Manual. This value is directly computed by STM32CubeMX2.
  * @retval STM32_UTILS_I2C_OK    Timing calculation successful.
  * @retval STM32_UTILS_I2C_ERROR Timing calculation error.
  */
stm32_utils_i2c_status_t STM32_UTILS_I2C_ComputeTimingAdvanced(const stm32_utils_i2c_timing_advanced_config_t *p_config,
                                                               uint32_t *p_output_timing_reg)
{
  stm32_utils_i2c_status_t status = STM32_UTILS_I2C_ERROR;
  uint32_t idx;

  i2c_valid_timing_nbr = 0U;

  if ((p_config->clock_src_freq_hz != 0U) && (p_config->i2c_freq_hz != 0U))
  {
    for (uint32_t speed = 0U; speed <= (uint32_t)I2C_SPEED_FREQ_FAST_PLUS; speed++)
    {
      if ((p_config->i2c_freq_hz >= i2c_charac[speed].freq_min) \
          && (p_config->i2c_freq_hz <= i2c_charac[speed].freq_max))
      {
        if (I2C_Compute_PRESC_SCLDEL_SDADEL(p_config, speed) != STM32_UTILS_I2C_OK)
        {
          return STM32_UTILS_I2C_ERROR;
        }

        idx = I2C_Compute_SCLL_SCLH(p_config, speed);

        if (idx < I2C_VALID_TIMING_NBR_MAX)
        {
          *p_output_timing_reg = ((i2c_valid_timing[idx].presc   & 0x0FUL) << 28U) | \
                                 ((i2c_valid_timing[idx].tscldel & 0x0FUL) << 20U) | \
                                 ((i2c_valid_timing[idx].tsdadel & 0x0FUL) << 16U) | \
                                 ((i2c_valid_timing[idx].sclh    & 0xFFUL) << 8U)  | \
                                 (i2c_valid_timing[idx].scll     & 0xFFUL);

          status = STM32_UTILS_I2C_OK;
        }
        break;
      }
    }
  }

  return status;
}

/**
  * @brief  Compute timeout A using the current I2C clock source, IDLE mode, and timeout requested in ns.
  * @param  p_config Pointer to a @ref stm32_utils_i2c_timeouta_config_t structure containing the desired
  *         timeout parameters.
  * @param  p_output_timeout_reg Pointer to an I2C_TIMEOUTR register value computed.
  *         This value is directly computed by STM32CubeMX2.
  * @note   When IDLE mode is disabled, the timeout value must be between 25000000 ns and 35000000 ns per the SMBUS
  *         specification.
  * @note   When IDLE mode is enabled, the timeout value must be under tIDLE= (0xFFF + 1) x 4 x tI2CCLK.
  * @retval STM32_UTILS_I2C_OK            Timing calculation successful.
  * @retval STM32_UTILS_I2C_INVALID_PARAM Invalid parameter.
  */
stm32_utils_i2c_status_t STM32_UTILS_I2C_CompTimeoutA(const stm32_utils_i2c_timeouta_config_t *p_config,
                                                      uint32_t *p_output_timeout_reg)
{
  double_t ti2cclk;
  double_t timeout_reg;
  stm32_utils_i2c_status_t status = STM32_UTILS_I2C_INVALID_PARAM;

  if (p_config != NULL)
  {
    if (p_config->clock_src_freq_hz != 0U)
    {
      uint32_t timeout_ns = p_config->timeout_ns;
      ti2cclk = (double_t)SEC2NSEC / (double_t)p_config->clock_src_freq_hz;
      if (ti2cclk > 0.0)
      {
        if (p_config->timeouta_mode == STM32_UTILS_I2C_TIMEOUTA_SDA_SCL_HIGH)
        {
          /* Compute the p_output_timeout_reg value based on Reference manual formula:
             tIDLE= (TIMEOUTA + 1) x 4 x tI2CCLK */
          timeout_reg = DIV_ROUND_CLOSEST((double_t)timeout_ns, (ti2cclk * 4.0)) - 1.0;
          *p_output_timeout_reg = (uint32_t)timeout_reg;
          if (*p_output_timeout_reg <= 0xFFFU)
          {
            status = STM32_UTILS_I2C_OK;
          }
        }
        else
        {
          if ((timeout_ns <= SMBUS_IDLE_TIMEOUT_MAX) && (timeout_ns >= SMBUS_IDLE_TIMEOUT_MIN))
          {
            /* Compute the p_output_timeout_reg value based on Reference manual formula:
               tTIMEOUT= (TIMEOUTA + 1) x 2048 x tI2CCLK */
            timeout_reg = DIV_ROUND_CLOSEST((double_t)timeout_ns, (ti2cclk * 2048.0)) - 1.0;
            *p_output_timeout_reg = (uint32_t)timeout_reg;

            status = STM32_UTILS_I2C_OK;
          }
        }
      }
    }
  }
  return status;
}

/**
  * @brief  Compute timeout B using the current I2C clock source, device mode, and timeout requested in ns.
  * @param  p_config Pointer to a @ref stm32_utils_i2c_timeoutb_config_t structure containing the desired
  *         timeout parameters.
  * @param  p_output_timeout_reg Pointer to an I2C_TIMEOUTR register value computed.
  *         This value is directly computed by STM32CubeMX2.
  * @retval STM32_UTILS_I2C_OK            Timing calculation successful.
  * @retval STM32_UTILS_I2C_INVALID_PARAM Invalid parameter.
  */
stm32_utils_i2c_status_t STM32_UTILS_I2C_CompTimeoutB(const stm32_utils_i2c_timeoutb_config_t *p_config,
                                                      uint32_t *p_output_timeout_reg)
{
  double_t ti2cclk;
  double_t timeout_reg;
  stm32_utils_i2c_status_t status = STM32_UTILS_I2C_INVALID_PARAM;
  if (p_config != NULL)
  {
    if (p_config->clock_src_freq_hz != 0U)
    {
      uint32_t timeout_ns = p_config->timeout_ns;
      ti2cclk = (double_t)SEC2NSEC / (double_t)p_config->clock_src_freq_hz;
      if (ti2cclk > 0.0)
      {
        if (p_config->device_mode == STM32_UTILS_I2C_SLAVE_MODE)
        {
          if (timeout_ns <= SMBUS_SLAVE_EXT_LOW_TIMEOUT_MAX)
          {
            /* Compute the p_output_timeout_reg value based on Reference manual formula:
               tLOW:SEXT= (TIMEOUTB + 1) x 2048 x tI2CCLK */
            timeout_reg = DIV_ROUND_CLOSEST((double_t)timeout_ns, (ti2cclk * 2048.0)) - 1.0;
            *p_output_timeout_reg = (uint32_t)timeout_reg;

            status = STM32_UTILS_I2C_OK;
          }
        }
        else
        {
          if (timeout_ns <= SMBUS_MASTER_EXT_LOW_TIMEOUT_MAX)
          {
            /* Compute the p_output_timeout_reg value based on Reference manual formula:
               tLOW:MEXT= (TIMEOUTB + 1) x 2048 x tI2CCLK */
            timeout_reg = DIV_ROUND_CLOSEST((double_t)timeout_ns, (ti2cclk * 2048.0)) - 1.0;
            *p_output_timeout_reg = (uint32_t)timeout_reg;

            status = STM32_UTILS_I2C_OK;
          }
        }
      }
    }
  }
  return status;
}

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/**
  * @brief  Compute PRESC, SCLDEL, and SDADEL.
  * @param  p_config Pointer to a @ref stm32_utils_i2c_timing_advanced_config_t structure containing the timing
  *         configuration parameters.
  * @param  i2c_speed I2C frequency (index).
  * @retval STM32_UTILS_I2C_OK    Timing calculation successful.
  * @retval STM32_UTILS_I2C_ERROR Timing calculation error.
  */
static stm32_utils_i2c_status_t I2C_Compute_PRESC_SCLDEL_SDADEL(const stm32_utils_i2c_timing_advanced_config_t
                                                                *p_config,
                                                                uint32_t i2c_speed)
{
  stm32_utils_i2c_status_t status = STM32_UTILS_I2C_ERROR;
  uint32_t prev_presc = I2C_PRESC_MAX;
  double_t ti2cclk;
  double_t tsdadel_min;
  double_t tsdadel_max;
  double_t tscldel_min;
  double_t tafdel_min;
  double_t tafdel_max;

  ti2cclk = (double_t)SEC2NSEC / (double_t)p_config->clock_src_freq_hz;

  tafdel_min = (p_config->af == STM32_UTILS_I2C_ANALOG_FILTER_ENABLED) ? I2C_ANALOG_FILTER_DELAY_MIN : 0.0;
  tafdel_max = (p_config->af == STM32_UTILS_I2C_ANALOG_FILTER_ENABLED) ? I2C_ANALOG_FILTER_DELAY_MAX : 0.0;

  /**
    * tDNF = DNF x tI2CCLK
    * tPRESC = (PRESC+1) x tI2CCLK
    * SDADEL >= {tf +tHD;DAT(min) - tAF(min) - tDNF - [3 x tI2CCLK]} / {tPRESC}
    * SDADEL <= {tVD;DAT(max) - tr - tAF(max) - tDNF- [4 x tI2CCLK]} / {tPRESC}.
    */

  tsdadel_min = (double_t)p_config->tfall_ns + (double_t)i2c_charac[i2c_speed].hddat_min -
                tafdel_min - (((double_t)p_config->dnf + 3.0) * ti2cclk);

  tsdadel_max = (double_t)i2c_charac[i2c_speed].vddat_max - (double_t)p_config->trise_ns -
                tafdel_max - (((double_t)p_config->dnf + 4.0) * ti2cclk);


  /* {[tr+ tSU;DAT(min)] / [tPRESC]} - 1 <= SCLDEL */
  tscldel_min = (double_t)p_config->trise_ns + (double_t)i2c_charac[i2c_speed].sudat_min;

  if (tsdadel_min <= 0.0)
  {
    tsdadel_min = 0.0;
  }

  if (tsdadel_max <= 0.0)
  {
    tsdadel_max = 0.0;
  }

  for (uint32_t presc = 0U; presc < I2C_PRESC_MAX; presc++)
  {
    for (uint32_t scldel = 0U; scldel < I2C_SCLDEL_MAX; scldel++)
    {
      /* TSCLDEL = (SCLDEL+1) * (PRESC + 1) * TI2CCLK */
      double_t tscldel = ((double_t)scldel + 1.0) * ((double_t)presc + 1.0) * ti2cclk;

      if (tscldel >= tscldel_min)
      {
        for (uint32_t sdadel = 0U; sdadel < I2C_SDADEL_MAX; sdadel++)
        {
          /* TSDADEL = SDADEL * (PRESC + 1) * TI2CCLK */
          double_t tsdadel = ((double_t)sdadel * ((double_t)presc + 1.0)) * ti2cclk;

          if ((tsdadel >= tsdadel_min) && (tsdadel <= tsdadel_max))
          {
            if (presc != prev_presc)
            {
              i2c_valid_timing[i2c_valid_timing_nbr].presc   = presc;
              i2c_valid_timing[i2c_valid_timing_nbr].tscldel = scldel;
              i2c_valid_timing[i2c_valid_timing_nbr].tsdadel = sdadel;
              prev_presc                                     = presc;

