zhanzr/stm32c5-demo/board_t1_cmake/stm32c5xx_drivers/utils/i2c_timing/stm32_utils_i2c.c
              i2c_valid_timing_nbr ++;

              if (i2c_valid_timing_nbr >= I2C_VALID_TIMING_NBR_MAX)
              {
                return STM32_UTILS_I2C_ERROR;
              }
              else
              {
                status = STM32_UTILS_I2C_OK;
              }
            }
          }
        }
      }
    }
  }

  return status;
}

/**
  * @brief  Calculate SCLL and SCLH and find the best configuration.
  * @param  p_config Pointer to a @ref stm32_utils_i2c_timing_advanced_config_t structure containing the timing
  *         configuration parameters.
  * @param  i2c_speed I2C frequency (index).
  * @retval Configuration index (0 to I2C_VALID_TIMING_NBR_MAX), 0xAAAAAAAAU for no valid configuration.
  */
static uint32_t I2C_Compute_SCLL_SCLH(const stm32_utils_i2c_timing_advanced_config_t *p_config, uint32_t i2c_speed)
{
  uint32_t ret = 0xAAAAAAAAU;
  double_t ti2cclk;
  double_t ti2cspeed;
  double_t prev_error;
  double_t dnf_delay;
  double_t clk_min;
  double_t clk_max;
  double_t tafdel_min;
  uint32_t tmp;

  tmp = SEC2NSEC / p_config->clock_src_freq_hz;
  ti2cclk = (double_t)tmp;
  tmp = SEC2NSEC / p_config->i2c_freq_hz;
  ti2cspeed = (double_t)tmp;

  tafdel_min = (p_config->af == STM32_UTILS_I2C_ANALOG_FILTER_ENABLED) ? I2C_ANALOG_FILTER_DELAY_MIN : 0.0;

  /* tDNF = DNF x tI2CCLK */
  dnf_delay = (double_t)p_config->dnf * ti2cclk;

  tmp = SEC2NSEC / i2c_charac[i2c_speed].freq_min;
  clk_max = (double_t)tmp;
  tmp = SEC2NSEC / i2c_charac[i2c_speed].freq_max;
  clk_min = (double_t)tmp;

  prev_error = ti2cspeed;

  for (uint32_t count = 0U; count < i2c_valid_timing_nbr; count++)
  {
    /* tPRESC = (PRESC+1) x tI2CCLK*/
    double_t tpresc = ((double_t)i2c_valid_timing[count].presc + 1.0) * ti2cclk;

    for (uint32_t scll = 0U; scll < I2C_SCLL_MAX; scll++)
    {
      /* tLOW(min) <= tAF(min) + tDNF + 2 x tI2CCLK + [(SCLL + 1) x tPRESC ] */
      double_t tscl_l = tafdel_min + dnf_delay + (2.0 * ti2cclk) + (((double_t)scll + 1.0) * tpresc);

      /* The I2CCLK period tI2CCLK must respect the following conditions:
      tI2CCLK < (tLOW - tfilters) / 4 and tI2CCLK < tHIGH */
      if ((tscl_l > (double_t)i2c_charac[i2c_speed].lscl_min) && (ti2cclk < ((tscl_l - tafdel_min - dnf_delay) / 4.0)))
      {
        for (uint32_t sclh = 0U; sclh < I2C_SCLH_MAX; sclh++)
        {
          /* tHIGH(min) <= tAF(min) + tDNF + 2 x tI2CCLK + [(SCLH + 1) x tPRESC] */
          double_t tscl_h = tafdel_min + dnf_delay + (2.0 * ti2cclk) + (((double_t)sclh + 1.0) * tpresc);

          /* tSCL = tf + tLOW + tr + tHIGH */
          double_t tscl = tscl_l + tscl_h + (double_t)p_config->trise_ns + (double_t)p_config->tfall_ns;

          if ((tscl >= clk_min) && (tscl <= clk_max) && (tscl_h >= (double_t)i2c_charac[i2c_speed].hscl_min)
              && (ti2cclk < tscl_h))
          {
            double_t error = tscl - ti2cspeed;

            if (error < 0.0)
            {
              error = -error;
            }

            /* look for the timings with the lowest clock error */
            if (error < prev_error)
            {
              prev_error                   = error;
              i2c_valid_timing[count].scll = scll;
              i2c_valid_timing[count].sclh = sclh;
              ret                          = count;
            }
          }
        }
      }
    }
  }

  return ret;
}

/**
  * @}
  */

/**
  * @}
  */
